In [1]:
import pandas as pd

In [8]:
data={'Brand':['Asus','Acer','MSI','HP','Razer','Dell'], 
          'Model':['Zephyrus G14','Nitro 5','GF63','Pavillion','Blade','Allienware'],
          'price ($)':[1200,899,750,699,1100,899]}

df=pd.DataFrame(data,index=range(1,len(df)+1))
df

   Brand         Model  price ($)
1   Asus  Zephyrus G14       1200
2   Acer       Nitro 5        899
3    MSI          GF63        750
4     HP     Pavillion        699
5  Razer         Blade       1100
6   Dell    Allienware        899

In [ ]:
len(data)

In [9]:
len(df)

6

In [10]:
df['Brand']

1     Asus
2     Acer
3      MSI
4       HP
5    Razer
6     Dell
Name: Brand, dtype: object

In [11]:
df['MYR']=df['price ($)']*4.5
df

   Brand         Model  price ($)     MYR
1   Asus  Zephyrus G14       1200  5400.0
2   Acer       Nitro 5        899  4045.5
3    MSI          GF63        750  3375.0
4     HP     Pavillion        699  3145.5
5  Razer         Blade       1100  4950.0
6   Dell    Allienware        899  4045.5

In [13]:
df.index

RangeIndex(start=1, stop=7, step=1)

In [14]:
df.columns

Index(['Brand', 'Model', 'price ($)', 'MYR'], dtype='object')

In [ ]:
df[2:4]

In [ ]:
df[:10]

In [ ]:
df[::-1]

In [ ]:
df[3:]

In [ ]:
df[:-1]

In [ ]:
df.loc[:,'Model']

In [ ]:
df[['Model']]

In [ ]:
df[['Brand','Model']]

In [ ]:
frameCopy=df.copy()
frameCopy

In [ ]:
frameCopy.T

In [ ]:
df[::2]

In [15]:
df.index.name='Hardware List'
df

               Brand         Model  price ($)     MYR
Hardware List
1               Asus  Zephyrus G14       1200  5400.0
2               Acer       Nitro 5        899  4045.5
3                MSI          GF63        750  3375.0
4                 HP     Pavillion        699  3145.5
5              Razer         Blade       1100  4950.0
6               Dell    Allienware        899  4045.5

In [16]:
df.columns.name='Details'
df

Details        Brand         Model  price ($)     MYR
Hardware List
1               Asus  Zephyrus G14       1200  5400.0
2               Acer       Nitro 5        899  4045.5
3                MSI          GF63        750  3375.0
4                 HP     Pavillion        699  3145.5
5              Razer         Blade       1100  4950.0
6               Dell    Allienware        899  4045.5

In [17]:
df.index.name

'Hardware List'

In [ ]:
series=pd.Series([10,20,30],index=['a','b','c'])
series

In [ ]:
series.index[2]

In [ ]:
type(series.index)

In [ ]:
series.index[0]='A'
series

In [ ]:
df.columns.name

In [ ]:
df.columns

In [ ]:
'Brand' in df.columns

In [ ]:
df.index.unique()

In [ ]:
num=[1,3,5,7]
num.append(4)
num

In [ ]:
df

In [18]:
pd.DataFrame(df['Brand'].unique())

       0
0   Asus
1   Acer
2    MSI
3     HP
4  Razer
5   Dell

In [ ]:
frame

In [20]:
data={'Brand':['Asus','Acer','MSI','HP','Razer','Dell'], 
          'Model':['Zephyrus G14','Nitro 5','GF63','Pavillion','Blade','Allienware'],
          'price ($)':[1200,899,750,699,1100,899]}
df=pd.DataFrame(data,index=range(1,len(df)+1))
df

   Brand         Model  price ($)
1   Asus  Zephyrus G14       1200
2   Acer       Nitro 5        899
3    MSI          GF63        750
4     HP     Pavillion        699
5  Razer         Blade       1100
6   Dell    Allienware        899

In [21]:
df

   Brand         Model  price ($)
1   Asus  Zephyrus G14       1200
2   Acer       Nitro 5        899
3    MSI          GF63        750
4     HP     Pavillion        699
5  Razer         Blade       1100
6   Dell    Allienware        899

In [22]:
frame2=df.reindex([6,5,4,3,2,1])
frame2

   Brand         Model  price ($)
6   Dell    Allienware        899
5  Razer         Blade       1100
4     HP     Pavillion        699
3    MSI          GF63        750
2   Acer       Nitro 5        899
1   Asus  Zephyrus G14       1200

In [23]:
frameCopy=df.copy()
frameCopy

   Brand         Model  price ($)
1   Asus  Zephyrus G14       1200
2   Acer       Nitro 5        899
3    MSI          GF63        750
4     HP     Pavillion        699
5  Razer         Blade       1100
6   Dell    Allienware        899

In [ ]:
frameCopy.drop(3)

In [ ]:
frameCopy.drop('Brand',axis=1)

In [24]:
df

   Brand         Model  price ($)
1   Asus  Zephyrus G14       1200
2   Acer       Nitro 5        899
3    MSI          GF63        750
4     HP     Pavillion        699
5  Razer         Blade       1100
6   Dell    Allienware        899

In [ ]:
frame.columns[['Model','price']]

In [25]:
df[['Brand','Model']]

   Brand         Model
1   Asus  Zephyrus G14
2   Acer       Nitro 5
3    MSI          GF63
4     HP     Pavillion
5  Razer         Blade
6   Dell    Allienware

In [26]:
df[['Model','price ($)']]

          Model  price ($)
1  Zephyrus G14       1200
2       Nitro 5        899
3          GF63        750
4     Pavillion        699
5         Blade       1100
6    Allienware        899

In [27]:
df.loc[[2,3],['Model','price ($)']]

     Model  price ($)
2  Nitro 5        899
3     GF63        750

In [28]:
df.loc[:5,['Model','Brand']]

          Model  Brand
1  Zephyrus G14   Asus
2       Nitro 5   Acer
3          GF63    MSI
4     Pavillion     HP
5         Blade  Razer

In [29]:
df.loc[:3,['Model']]

          Model
1  Zephyrus G14
2       Nitro 5
3          GF63

In [30]:
df

   Brand         Model  price ($)
1   Asus  Zephyrus G14       1200
2   Acer       Nitro 5        899
3    MSI          GF63        750
4     HP     Pavillion        699
5  Razer         Blade       1100
6   Dell    Allienware        899

In [31]:
df.sort_index(ascending=False)

   Brand         Model  price ($)
6   Dell    Allienware        899
5  Razer         Blade       1100
4     HP     Pavillion        699
3    MSI          GF63        750
2   Acer       Nitro 5        899
1   Asus  Zephyrus G14       1200

In [32]:
df['price ($)'].sum()

5547

In [33]:
df.sum(axis=0)

Brand                                 AsusAcerMSIHPRazerDell
Model        Zephyrus G14Nitro 5GF63PavillionBladeAllienware
price ($)                                               5547
dtype: object

In [34]:
df

   Brand         Model  price ($)
1   Asus  Zephyrus G14       1200
2   Acer       Nitro 5        899
3    MSI          GF63        750
4     HP     Pavillion        699
5  Razer         Blade       1100
6   Dell    Allienware        899

In [35]:
df['Brand'].describe()

count      6
unique     6
top       HP
freq       1
Name: Brand, dtype: object

In [36]:
df['Model'].describe()

count             6
unique            6
top       Pavillion
freq              1
Name: Model, dtype: object

In [37]:
df.describe()

         price ($)
count     6.000000
mean    924.500000
std     194.577234
min     699.000000
25%     787.250000
50%     899.000000
75%    1049.750000
max    1200.000000

In [ ]:
df

In [38]:
filtered=df.loc[:3]
#filtered['price ($)'].sum()

In [39]:
filtered

  Brand         Model  price ($)
1  Asus  Zephyrus G14       1200
2  Acer       Nitro 5        899
3   MSI          GF63        750

In [42]:
df['MYR']=df['price ($)']*4.5
df

   Brand         Model  price ($)     MYR
1   Asus  Zephyrus G14       1200  5400.0
2   Acer       Nitro 5        899  4045.5
3    MSI          GF63        750  3375.0
4     HP     Pavillion        699  3145.5
5  Razer         Blade       1100  4950.0
6   Dell    Allienware        899  4045.5

In [43]:
df[['price ($)','MYR']].sum()

price ($)     5547.0
MYR          24961.5
dtype: float64

In [44]:
df['MYR'].idxmax()

1

In [45]:
df['MYR'].idxmin()

4

In [46]:
df['price ($)'].idxmax()

1

In [47]:
df['price ($)'].max()

1200

In [49]:
df.loc[df['price ($)'].idxmax(),:]

Brand                Asus
Model        Zephyrus G14
price ($)            1200
MYR                  5400
Name: 1, dtype: object

In [50]:
df

   Brand         Model  price ($)     MYR
1   Asus  Zephyrus G14       1200  5400.0
2   Acer       Nitro 5        899  4045.5
3    MSI          GF63        750  3375.0
4     HP     Pavillion        699  3145.5
5  Razer         Blade       1100  4950.0
6   Dell    Allienware        899  4045.5

In [52]:
data={'Brand':['Asus','Acer','MSI','HP','Razer','Dell'], 
          'Model':['Zephyrus G14','Nitro 5','GF63','Pavillion','Blade','Allienware'],
          'price ($)':[1200,899,750,699,1100,899]}
df=pd.DataFrame(data,index=range(1,len(df)+1))
df

   Brand         Model  price ($)
1   Asus  Zephyrus G14       1200
2   Acer       Nitro 5        899
3    MSI          GF63        750
4     HP     Pavillion        699
5  Razer         Blade       1100
6   Dell    Allienware        899

In [ ]:
len(data)

In [53]:
len(df)

6

In [55]:
df.loc[df['price ($)'].idxmax(),:]

Brand                Asus
Model        Zephyrus G14
price ($)            1200
Name: 1, dtype: object

In [57]:
df['Brand'].value_counts()

HP       1
Acer     1
Asus     1
MSI      1
Dell     1
Razer    1
Name: Brand, dtype: int64

In [58]:
pd.value_counts(df['Brand'])

HP       1
Acer     1
Asus     1
MSI      1
Dell     1
Razer    1
Name: Brand, dtype: int64